In [1]:
import pandas as pd
import numpy as np
import random as rnd
import tensorflow as tf
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
train_df = pd.read_csv('C:/Users/maste/PycharmProjects/Kaggle/Titanic/Dataset/train.csv')
test_df = pd.read_csv('C:/Users/maste/PycharmProjects/Kaggle/Titanic/Dataset/test.csv')

In [3]:
num_rows = train_df.shape[0]

In [5]:
counter_nan = train_df.isnull().sum()

In [6]:
counter_without_nan= counter_nan[counter_nan==0]

In [9]:
# Remove the column with missing elements
train_df = train_df[counter_without_nan.keys()]

In [10]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500

In [12]:
# Columns to normalize
cols_to_norm = ['Parch','Fare','SibSp']

In [14]:
train_df.sample(30)

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
523,524,1,1,"Hippach, Mrs. Louis Albert (Ida Sophia Fischer)",female,0,1,111361,57.9792
527,528,0,1,"Farthing, Mr. John",male,0,0,PC 17483,221.7792
27,28,0,1,"Fortune, Mr. Charles Alexander",male,3,2,19950,263.0000
697,698,1,3,"Mullens, Miss. Katherine ""Katie""",female,0,0,35852,7.7333
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,1,0,237736,30.0708
639,640,0,3,"Thorneycroft, Mr. Percival",male,1,0,376564,16.1000
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,0,1,PC 17755,512.3292
704,705,0,3,"Hansen, Mr. Henrik Juul",male,1,0,350025,7.8542
708,709,1,1,"Cleaver, Miss. Alice",female,0,0,113781,151.5500
186,187,1,3,"O'Brien, Mrs. Thomas (Johanna ""Hannah"" Godfrey)",female,1,0,370365,15.5000
716,717,1,1,"Endres, Miss. Caroline Louise",female,0,0,PC 17757,227.5250
691,692,1,3,"Karun, Miss. Manca",female,0,1,349256,13.4167
250,251,0,3,"Reed, Mr. James George",male,0,0,362316,7.2500
665,666,0,2,"Hickman, Mr. Lewis",male,2,0,S.O.C. 14879,73.5000
99,100,0,2,"Kantor, Mr. Sinai",male,1,0,244367,26.0000
271,272,1,3,"Tornquist, Mr. William Henry",male,0,0,LINE,0.0000
59,60,0,3,"Goodwin, Master. William Frederick",male,5,2,CA 2144,46.9000
126,127,0,3,"McMahon, Mr. Martin",male,0,0,370372,7.7500
547,548,1,2,"Padro y Manent, Mr. Julian",male,0,0,SC/PARIS 2146,13.8625
223,224,0,3,"Nenkoff, Mr. Christo",male,0,0,349234,7.8958
363,364,0,3,"Asim, Mr. Adola",male,0,0,SOTON/O.Q. 3101310,7.0500
204,205,1,3,"Cohen, Mr. Gurshon ""Gus""",male,0,0,A/5 3540,8.0500
569,570,1,3,"Jonsson, Mr. Carl",male,0,0,350417,7.8542
780,781,1,3,"Ayoub, Miss. Banoura",female,0,0,2687,7.2292
584,585,0,3,"Paulner, Mr. Uscher",male,0,0,3411,8.7125
242,243,0,2,"Coleridge, Mr. Reginald Charles",male,0,0,W./C. 14263,10.5000
265,266,0,2,"Reeves, Mr. David",male,0,0,C.A. 17248,10.5000
357,358,0,2,"Funk, Miss. Annie Clemmer",female,0,0,237671,13.0000
249,250,0,2,"Carter, Rev. Ernest Courtenay",male,1,0,244252,26.0000
562,563,0,2,"Norman, Mr. Robert Douglas",male,0,0,218629,13.5000

In [15]:
train_df[cols_to_norm] = train_df[cols_to_norm].apply(lambda x: (x - x.min()) / (x.max() - x.min()))

In [16]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,0.125,0.0,A/5 21171,0.014151
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,0.125,0.0,PC 17599,0.139136
2,3,1,3,"Heikkinen, Miss. Laina",female,0.000,0.0,STON/O2. 3101282,0.015469
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,0.125,0.0,113803,0.103644
4,5,0,3,"Allen, Mr. William Henry",male,0.000,0.0,373450,0.015713